pipeline {
    agent any 
// Добавляем триггер опроса репозитория
    triggers {
        // Проверять GitHub каждую минуту на наличие новых коммитов
        pollSCM('* * * * *')
    }
    stages {
        stage('Checkout') {
            steps {
                echo '=== Шаг 1: Код успешно скачан из GitHub ==='
            }
        }

        stage('Linter Test') {
            steps {
                echo '=== Шаг 2: Проверка качества кода ==='
                echo 'Запуск проверки HTML и JS...'
                
                // Имитируем критическую ошибку в коде (например, пропущенная точка с запятой)
                error 'Критическая ошибка синтаксиса в файле index.html! Сборка остановлена.'
            }
        }

        stage('OpenShift Prep') {
            steps {
                echo '=== Шаг 3: Подготовка к деплою в OpenShift ==='
                echo 'Формируем конфигурационный файл приложения...'
            }
        }
    }

        post {
        success {
            echo '=== МОНИТОРИНГ: Сборка успешна. Отправляем метрику OK в Grafana ==='
        }
        failure {
            // В Сбере здесь будет вызов скрипта отправки алерта в Телеграм/Mattermost/Сберчат или СМАРТ (систему алертов)
            echo '=== !!! МОНИТОРИНГ ЧП !!! ==='
            echo "АЛЕРТ: Пайплайн ${env.JOB_NAME} (Сборка №${env.BUILD_NUMBER}) УПАЛ!"
            echo "Ссылка на логи: ${env.BUILD_URL}console"
            echo 'Отправляем критический инцидент в дежурную смену...'
        }
    }

    }
}
